Tekla.Structures.Model.ISharedModel
Represents a shared model in the Tekla Structures environment.
Contains metadata such as Id, Name, Code, Description, Owner, creation date, and the current user's sharing role.

Tekla.Structures.Model.ISharedModel.Id
Gets the unique identifier of the shared model.

Tekla.Structures.Model.ISharedModel.Name
Gets the name of the shared model.

Tekla.Structures.Model.ISharedModel.Code
Gets the code associated with the shared model.

Tekla.Structures.Model.ISharedModel.Description
Gets the description of the shared model.

Tekla.Structures.Model.ISharedModel.Owner
Gets the owner of the shared model.

Tekla.Structures.Model.ISharedModel.CreatedAt
Gets the date and time when the shared model was created.

Tekla.Structures.Model.ISharedModel.CurrentUserRole
Gets the sharing role of the current user for this model.